Repository: DuThuBa319/mobile_health_check
Catalog: lib/assets/languages/app_*.arb
Languages: vi

source: Age
vi: Tuổi

source: Back
vi: Trở lại

source: BLOOD PRESSURE
vi: ĐO HUYẾT ÁP

source: BLOOD SUGAR
vi: ĐO ĐƯỜNG HUYẾT

source: BODY TEMPERATURE
vi: ĐO THÂN NHIỆT

source: SPO2
vi: ĐO NỒNG ĐỘ OXI

source: Pulse oximeter
vi: ĐO NỒNG ĐỘ OXI

source: Change language success
vi: Đổi ngôn ngữ thành công

# confirmNewPass
source: Confirm new password
vi: Xác nhận lại mật khẩu mới

# waitForSeconds
source: Please wait for seconds
vi: Xin hãy đợi vài giây

# dontHaveAccount
source: Don't have an account?
vi: Bạn chưa có tài khoản?

# forgotPass
source: Forgot password?
vi: Quên mật khẩu?

source: Height
vi: Chiều cao

source: History
vi: Lịch sử

# homeScreen
source: Patient List
vi: Danh sách

source: Hyperglycemia
vi: Đường huyết cao

source: Hyperthermia
vi: Nhiệt độ cao

source: Hypoglycemia
vi: Đường huyết thấp

source: hypotension
vi: Huyết áp thấp

source: Hypothermia
vi: Nhiệt độ thấp

# goodSpo2
source: Good blood oxygen saturation
vi: Chỉ số Oxy trong máu tốt

# averageSpo2
source: Average blood oxygen saturation
vi: Chỉ số Oxy trong máu trung bình

# lowSpo2
source: Low blood oxygen saturation
vi: Chỉ số Oxy trong máu thấp

# emergencySpo2
source: Sign of severe respiratory distress
vi: Dấu hiệu suy hô hấp

source: Language
vi: Ngôn ngữ

# lastUpdate
source: LAST READING
vi: CẬP NHẬT GẦN NHẤT

source: Log Out
vi: Đăng xuất

# areYouSureToLogOut
source: Are you sure you want to Log Out?
vi: Bạn có chắc muốn đăng xuất?

source: Notification
vi: Thông báo

# updateIndicator
source: Updated new indicator
vi: Bệnh nhân cập nhật chỉ số mới.

# updateBloodPressure
source: Blood pressure update
vi: Cập nhật huyết áp.

# updateBloodSugar
source: Blood sugar update
vi: Cập nhật đường huyết.

# updateBodytemperature
source: Body temperature update
vi: Cập nhật thân nhiệt.

# updateSpo2
source: SpO2 update
vi: Cập nhật SpO2.

source: New password
vi: Mật khẩu mới

# newPhoneNumber
source: Your New PhoneNumber
vi: Cập nhật số điện thoại mới

# normalBP
source: Normal blood pressure
vi: Huyết áp bình thường

# normalBS
source: Normal Blood Sugar
vi: Đường huyết bình thường

# normalBT
source: Normal body temperature
vi: Nhiệt độ bình thường

# oldPassword
source: Previous password
vi: Mật khẩu cũ

# oldPhoneNumber
source: Previous PhoneNumber
vi: Số điện thoại cũ

source: Password
vi: Mật khẩu

# patientIn4
source: Patient Information
vi: Thông tin bệnh nhân

source: PATIENT LIST
vi: Danh sách bệnh nhân

source: DOCTOR LIST
vi: Danh sách bác sĩ

source: PhoneNumber
vi: Số điện thoại

source: Prediabetes
vi: Tiền tiểu đường

source: Prehypertension
vi: Tiền huyết áp cao

source: Save
vi: Lưu

source: Search
vi: Tìm kiếm

source: Search patient
vi: Tìm kiếm bệnh nhân

source: Search doctor
vi: Tìm kiếm bác sĩ

source: Select Language
vi: Lựa chọn ngôn ngữ

source: Select Time
vi: Chọn các mốc thời gian

source: Setting
vi: Cài đặt

# settingScreen
source: Setting
vi: Cài đặt

source: Sign in
vi: Đăng nhập

source: Sign up
vi: Đăng ký

source: Stage 1 hypertension
vi: Huyết áp cấp độ 1

source: Stage 2 hypertension
vi: Huyết áp cấp độ 2

# stage3hypertension
source: Stage 2 hypertension
vi: Huyết áp cấp độ 3

source: Time
vi: Ngày giờ

source: Back to list
vi: Trở lại danh sách

source: Update Password
vi: Cập nhật mật khẩu

source: Update Password Successfullly
vi: Đổi mật khẩu thành công

source: Update Phone Number
vi: Cập nhật số điện thoại

source: Update Phone Number Successfullly
vi: Dổi số điện thoại đăng nhập thành công

# veryhightbodytemperature
source: Very high
vi: Nhiệt độ rất cao

# watchHistory
source: History
vi: Lịch sử

source: Weight
vi: Cân nặng

source: Loading data
vi: Đang tải dữ liệu

# dataLoaded
source: Data Loaded Successfully
vi: Tải dữ liệu thành công

# loadingError
source: loading Data Error
vi: Tải dữ liệu không thành công

# selectEquip
source: Select Equipment
vi: Chọn thiết bị

source: Blood Glucose Meter
vi: ĐO ĐƯỜNG HUYẾT

source: Thermometer
vi: ĐO THÂN NHIỆT

source: Blood Pressure Meter
vi: ĐO HUYẾT ÁP

source: Upload
vi: Gửi đi

source: Exit
vi: Thoát

# uploadPhotoError
source: Unable to load the image
vi: Không tải được hình ảnh

source: Upload Successfully
vi: Gửi thông tin thành công

# uploadBloodPressureSuccessfully
source: You've successfully updated new blood pressure readings
vi: Bạn đã cập nhật chỉ số huyết áp mới thành công

# uploadBloodSugarSuccessfully
source: You've successfully updated new blood sugar readings
vi: Bạn đã cập nhật chỉ số đường huyết mới thành công

# uploadBodyTemperatureSuccessfully
source: You've successfully updated new body temperature readings
vi: Bạn đã cập nhật chỉ số thân nhiệt mới thành công

# uploadSpo2Successfully
source: You've successfully updated new oxygen saturation levels
vi: Bạn đã cập nhật chỉ số nồng độ oxi mới thành công

# editIndicatore
source: Edit value
vi: Điền số liệu chính xác theo thiết bị

source: Confirm
vi: Xác nhận

# titileForgetPass
source: Don't worry! Enter the phone number you used to register in the box below to receive new password
vi: Đừng lo lắng! Hãy nhập số điện thoại đã đăng ký để nhận lại mật khẩu mới nhé.

# wrongPhoneNumber
source: This phone number hasn't been registered
vi: Số điện thoại này chưa được đăng ký

# name
source: Full name
vi: Họ và tên

source: Street
vi: Tên đường

source: ward
vi: Phường

source: City
vi: Thành phố

source: Country
vi: Quốc gia

source: Update profile
vi: Chỉnh sửa thông tin

source: District
vi: Quận

source: Update Profile Successfully
vi: Chỉnh sửa thông tin thành công

source: Processing
vi: Đang xử lý...

source: Camera Screen
vi: Màn hình máy đo

source: Error
vi: Đã xảy ra lỗi

# holdForFewSec
source: Hold for a few seconds
vi: Giữ vị trí trong vài giây

# processSuccessfully
source: Processed Successfully
vi: Xử lý thành công

source: Accept
vi: Đồng ý

source: Take Photo Again
vi: Chụp lại

source: Your photo
vi: Hình ảnh vừa chụp

# unableToRecognizeReading
source: Unable to recognize the captured reading, please take another photo!
vi: Không nhận diện được số liệu, vui lòng chụp lại!

# errorWhileTakingPhoto
source: Error occured while taking picture
vi: Xảy ra lỗi khi chụp ảnh

source: Photo loading
vi: Đang lấy hình ảnh

# verifying
source: Verifying, please wait
vi: Đang xác thực, vui lòng chờ...

source: Verify Successfully
vi: Xác thực thành công

# pleaseEnterYourAccount
source: Please fill in phone number and password
vi: Vui lòng nhập đủ thông tin

# pleaseEnterRelativeName
source: Please fill in relatives name
vi: Vui lòng nhập tên người thân

# pleaseEnterPatientName
source: Please fill in patient's name
vi: Vui lòng nhập tên bệnh nhân

# pleaseEnterDoctorName
source: Please fill in doctor's name
vi: Vui lòng nhập tên bác sĩ

# pleaseEnterRelativePhoneNumber
source: Please fill in realtives phonenumber
vi: Vui lòng nhập số điện thoại người thân

# pleaseEnterPatientPhoneNumber
source: Please fill in patient's phonenumber
vi: Vui lòng nhập số điện thoại bệnh nhân

# pleaseEnterDoctorPhoneNumber
source: Please fill in doctor's phonenumber
vi: Vui lòng nhập số điện thoại bác sĩ

# updateProfileSuccessText
source: You have successfully updated personal information
vi: Bạn đã cập nhật thông tin cá nhân thành công

# addPatientSuccessText
source: You have successfully added a new patient to the list
vi: Bạn đã thành công thêm một bệnh nhân mới vào danh sách

# addRelativeSuccessText
source: You have successfully added a relative for this patient
vi: Bạn đã thành công thêm một người thân cho bệnh nhân này

# addDoctorSuccessText
source: You have successfully added a new doctor to the list
vi: Bạn đã thành công thêm một bác sĩ mới vào danh sách

# resetPassSuccessText
source: Your password after being reset is:
vi: Mật khẩu sau khi được cấp lại là:

# changePassSuccessText
source: You have successfully changed password Please remember it for next logins!
vi: Bạn đã đổi mật khẩu thành công, hãy ghi nhớ cho những lần đăng nhập sau!

# tryLoggingAgain
source: Please try logging again!
vi: Hãy thử đăng nhập lại nhé!

source: Please update your name
vi: Vui lòng cập nhập họ và tên

source: Please update your phonenumber
vi: Vui lòng cập nhập số điện thoại

source: Please update your age
vi: Vui lòng cập nhập tuổi hiện tại

source: Please update your gender
vi: Vui lòng cập nhập giới tính

source: Please update your address
vi: Vui lòng cập nhập địa chỉ

source: Please update your weight
vi: Vui lòng cập nhập cân nặng hiện tại

source: Please update your height
vi: Vui lòng cập nhập chiều cao hiện tại

# duplicatedDoctorPhoneNumber
source: This phone number has been already registered by another account
vi: Số điện thoại đã được đăng ký bởi bác sĩ khác

# pleaseEnterYourCurrentPassword
source: Please fill in current password
vi: Vui lòng nhập mật khẩu hiện tại

# pleaseEnterYourNewPassword
source: Please fill in new password
vi: Vui lòng nhập mật khẩu mới

# pleaseEnterCompleteInformation
source: Please fill in the above information completely
vi: Vui lòng nhập đủ thông tin

# pleaseEnterCompleteLogin
source: Please fill in username and password
vi: Vui lòng nhập đủ thông tin

# invalidPhonenumber
source: Invalid phone number, must be 10-11 characters long
vi: Số điện thoại không chính xác, phải từ 10-11 ký tự

source: Add patient
vi: Thêm bệnh nhân

source: Add doctor
vi: Thêm bác sĩ

source: Gender
vi: Giới tính

source: Address
vi: Địa chỉ

source: Add patient successfully
vi: Thêm bệnh nhân thành công

source: Add doctor successfully
vi: Thêm bác sĩ thành công

source: Add relative successfully
vi: Thêm người thân thành công

source: Add relative
vi: Thêm người thân

# relativeIn4
source: Relative information
vi: Thông tin người thân

# doctorIn4
source: Doctor information
vi: Thông tin bác sĩ

source: Sign Up successfully
vi: Đăng ký thành công

source: Unread Notifications
vi: Số thông báo chưa đọc

# relative
source: PATIENT RELATIVES
vi: NGƯỜI THÂN BỆNH NHÂN

# oximeter
source: PULSE OXIMETER
vi: ĐO NỒNG ĐỘ OXY

# account
source: UserName
vi: Tài khoản

# deleteNotification
source: Delete this notification?
vi: Bạn muốn xóa thông báo này?

source: has just updated
vi: vừa cập nhật

# bloodSugarIndex
source: blood sugar readings
vi: chỉ số đường huyết

# bloodPressureIndex
source: blood pressure readings
vi: chỉ số huyết áp

# spo2Index
source: Spo2 readings
vi: chỉ số Spo2

# bodyTemperatureIndex
source: body temperature readings
vi: chỉ số thân nhiệt

source: Patient
vi: Bệnh nhân

source: his
vi: Anh ấy

source: her
vi: Cô ấy

# goToPatientIn4Screen
source: Patient infor screen
vi: Trang bệnh nhân

# goToNotificationScreen
source: Notification screen
vi: Trang thông báo

# endOfList
source: No more data to load
vi: Không còn thông báo

source: No Data
vi: Chưa có thông tin

# wifiDisconnect
source: No Wi-Fi connectivity
vi: Vui lòng kiểm tra kết nối Wifi!

# notUpdate
source: Unknown
vi: Chưa cập nhật

source: UserName
vi: Tài khoản

# errorTryAgain
source: Error Please try again!
vi: Đã xảy ra lỗi. Vui lòng thử lại!

# selectError
source: Start Date must be before End Date
vi: Ngày bắt đầu phải trước ngày kết thúc

# exitAppTitle
source: Exit App
vi: Thoát ứng dụng

# areYouSureToExitApp
source: Are you sure you want to exit the application?
vi: Bạn có chắc muốn thoát khỏi ứng dụng

source: No
vi: Không

source: Yes
vi: Đồng ý

source: Copy Successfully
vi: Sao chép thành công

# noPatient
source: There are no patients yet
vi: Chưa có bệnh nhân

# noDoctor
source: There are no doctors yet
vi: Chưa có bác sĩ

# wrongSearchPatient
source: No matching patients found
vi: Không tìm thấy bệnh nhân

# wrongSearchDoctor
source: No matching doctors found
vi: Không tìm thấy bác sĩ

# phoneNumberCountError
source: Incorrect phone number, must be 10-11 characters
vi: Số điện thoại không chính xác, phải từ 10-11 ký tự

# deleteRelative
source: Are you sure you want to remove this relative?
vi: Bạn chắc chắn muốn xóa người thân này?

# deletePatient
source: Are you sure you want to remove this patient?
vi: Bạn chắc chắn muốn xóa bệnh nhân này?

# deleteDoctor
source: Are you sure you want to remove this doctor?
vi: Bạn chắc chắn muốn xóa bác sĩ này?

# deleteRelativeWarningTitle
source: Delete relative
vi: Xóa người thân bệnh nhân

# deletePatientWarningTitle
source: Delete patient
vi: Xóa bệnh nhân

# deleteDoctorWarningTitle
source: Delete doctor
vi: Xóa bác sĩ

source: Delete relative successfully
vi: Xóa người thân thành công

source: Delete patient successfully
vi: Xóa bệnh nhân thành công

source: Delete doctor successfully
vi: Xóa bác sĩ thành công

source: Delete notification successfully
vi: Xóa thông báo thành công

source: Delete
vi: Xóa

# cannotDeleteDoctor
source: Can't delete the doctor still associated with patient accounts
vi: Không thể xóa bác sĩ còn liên kết với các tài khoản bệnh nhân

source: Deleting patient
vi: Đang xóa bệnh nhân

# deletingDoctoc
source: Deleting doctor
vi: Đang xóa bác sĩ

source: Deleting relative
vi: Đang xóa người thân

source: Call
vi: Liên hệ

# reset
source: Reset password
vi: Cấp lại mật khẩu

# pleaseEnterPhoneNumber
source: Please enter your phoneNumber
vi: Vui lòng hãy nhập số điện thoại

source: Reset password successfully
vi: Cấp lại mật khẩu thành công

# noNotification
source: No notifications have been received yet
vi: Chưa có thông báo

# doNotHaveInformation
source: Don't have information
vi: chưa có thông tin

source: Load again
vi: Tải lại

source: Male
vi: Nam

source: Female
vi: Nữ

# currentPassWrong
source: Wrong current password! Please try again
vi: Mật khẩu cũ không đúng! Vui lòng thử lại

# duplicatedPatientPhoneNumber
source: This phone number has been registered by another person
vi: Số điện thoại đã được đăng ký bởi bệnh nhân khác

# duplicatedRelationshipPAR
source: The relationship between these entities has been existed
vi: Bệnh nhân đã đăng ký với người thân có số điện thoại này rồi

# duplicatedRelationshipPAD
source: The relationship between these entities has been existed
vi: Bệnh nhân đã đăng ký với bác sĩ này rồi

# hasDoctorBefore
source: This patient has been managed by another doctor
vi: Bệnh nhân đã đăng ký với bác sĩ khác

# maximumRelativeCount
source: The number of relatives belonging to this patient is already maxium
vi: Số người thân đã đạt tối đa

# wrongAccount
source: Phone number or password is invalid. Try again!
vi: Số điện thoại hoặc mật khẩu không đúng. Vui lòng đăng nhập lại!

source: Contact
vi: Liên hệ

# permissionWarning
source: Please allow camera and microphone access
vi: Vui lòng cho phép truy cập camera và microphone
